// foreach გადაუვლის მასივის ყველა ელემენტს და გვაზლევს საშუალებას შევასრულოთ მათზე მოქმედებები
//არ ქმნის ახალ მასივს

//map გადაუვლის მასივს და ქმნის ახალ მასივს დამატებული შესრულებული მოქმედებით თითქმის იგივე რაც foreach მაგრამ ქმნის ახალ მასივს

//filter ფილტრავს ელემენტებს ჩვენი პირობის მიხედვით და გვიბრუნებს ახალ გაფილტრულ მასივს

//some ამოწმებს არსებობს თუ არა ისეთი ელემენტი მასივში რომელიც აკმაყოფილებს ჩვენ  მიერ გაწერილ პირობას


//high order functions არის მთავარი ფუნქცია იღებს სხვა ფუნქციას პარამეტრად ან აბრუნებს რაიმე ფუნქციას


// ნომერი 2

const names = ['ანა', 'ნიკა', 'გიორგი']

names.forEach((name) => {
    console.log(`hello ${name}`);
});


// ნომერი 3


const nums = [2, 4, 6, 8]


let newNums = nums.map((num) => {
    return num * 2;
});