/* ternary operation არის if/else მოკლედ ჩაწერის საშუალება,ვიყენებთ იმისთვის რომ კოდი იყოს უფრო ლამაზი და მოკლე
როგორ მუშაობს ეს ხერხი -- პირველი ვწერთ პირობას ,თუ სწორი იქნება ანუ true  სრულდება პუირველი ნაწილი ხოლო თუ არასწორი იქნა ანუ false სრულდება მეორე ნაწილი
მნიშვნელოვანი დეტალი არის ის რომ ამ ოპერაციას ვერ შევასრულებთ მხოლოდ if  პირობით აუცილებელია else
*/
/* განსხვავება ternary operationსა და if/else შორის არის ის რომ ternary-ს ვერ გამოვიყენებთ ორი პირობის გარეშე ხოლო if/else 
    შეგვიძლია მხოლოდ if პირობა გავუწეროთ
*/

let userAge = 19

userAge >= 18 ? console.log("u are an adult"): console.log("u are a kid") ;

/*Helper function არის დამხმარე ფუნქცია, რომელიც გამოიყენება მთავარი ფუნქციის მხარდასაჭერად. მისი მიზანია დიდი ამოცანის დაყოფა პატარა, 
მარტივ ნაწილებად და კოდის გამარტივება.

Main function არის პროგრამის მთავარი ფუნქცია, სადაც მიმდინარეობს ძირითადი ლოგიკა და იწყება ან სრულდება პროგრამის მთავარი მოქმედებები.
 ის ხშირად იყენებს helper functions-ს ამოცანის შესასრულებლად.
*/